fxanhkhoa/stm32f103_i2c--multi-sensor-mpu9250/Main.cpp
#include "stm32f10x.h"
#include "stm32f10x_i2c.h"
#include "stm32f10x_gpio.h"
#include "usart_print.h"	
#include "MPU9250.h"
#include "stm32f10x_tim.h"
#include "Main.h"
#include "MPU6050.h"
#include <math.h>
#include "Kalman.c"

#define Rad2Dree       57.295779513082320876798154814105
#define PI	3.1415926535897932384626433832795
#define declinationAngle  0.007563
#define alpha  0.5

//static void prvSetupHardware( void );
void sleep(long i);
void led_toggle(void);
float Distance(float x, float y);
int Get_Central(kalman p, kalman r, kalman y);
void LowPass_Accel(Accel fAcc[]);
void LowPass_Gyro(Gyro fGyro[]);
void LowPass_Mag(Mag fMag[]);
void Print_Bias();

uint16_t timer, time_pre =0, time_now = 0;
float gyroBias[3] = {0, 0, 0}, accelBias[3] = {0, 0, 0}; // Bias corrections for gyro and accelerometer
float magCalibration[3] = {0, 0, 0}, magbias[3] = {0, 0, 0};  // Factory mag calibration and mag bias

	
int main()
{
	//prvSetupHardware();
	/* Enable I2C and GPIO clocks */
    RCC_APB1PeriphClockCmd(MPU9250_I2C_RCC_Periph, ENABLE);
    RCC_APB2PeriphClockCmd(MPU9250_I2C_RCC_Port, ENABLE);
/***********************************************************************************************
*											GPIO_Init						
***********************************************************************************************/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	/* Set Led */
		GPIO_InitTypeDef GPIO_InitStruct,GPIO_InitStructure,GPIO;
		GPIO_InitStruct.GPIO_Pin = GPIO_Pin_13;
	  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_Out_PP;
	  GPIO_Init(GPIOC, &GPIO_InitStruct);
		
		GPIO_SetBits(GPIOC, GPIO_Pin_13);
		//GPIO_ResetBits(GPIOC, GPIO_Pin_13);

/*************************************************************************************
*																	USART_Init
**************************************************************************************/
			
	USART_InitTypeDef USART;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
	USART.USART_BaudRate = 38400;
	USART.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART.USART_StopBits = USART_StopBits_1;
	USART.USART_WordLength = USART_WordLength_8b;
	USART.USART_Parity = USART_Parity_No;
	USART.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	
	/*---- Configure USART1 ----*/
			USART_Init(USART1, &USART);
	/*---- Enable RXNE interrupt ----*/
			USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	/*---- USART ENABLE ----*/
			USART_Cmd(USART1, ENABLE);
		/*------ TX-Pin PA9 & RX-Pin PA10 -----*/
			
			GPIO.GPIO_Pin = GPIO_Pin_9;
			GPIO.GPIO_Mode = GPIO_Mode_AF_PP;
			GPIO.GPIO_Speed = GPIO_Speed_50MHz;
			GPIO_Init(GPIOA, & GPIO);
			
			GPIO.GPIO_Pin = GPIO_Pin_10;
			GPIO.GPIO_Mode = GPIO_Mode_IN_FLOATING;
			GPIO.GPIO_Speed = GPIO_Speed_50MHz;
			GPIO_Init(GPIOA, &GPIO);
			
/************************************************************************************************
*															I2C_Init
************************************************************************************************/
		I2C_InitTypeDef I2C_InitStructure;
    //GPIO_InitTypeDef GPIO_InitStructure;

    /* Configure I2C pins: SCL and SDA */
    GPIO_InitStructure.GPIO_Pin = MPU9250_I2C_SCL_Pin | MPU9250_I2C_SDA_Pin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_Init(MPU9250_I2C_Port, &GPIO_InitStructure);

    /* I2C configuration */
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x00;// MPU6050 7-bit adress = 0x68, 8-bit adress = 0xD0;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = MPU9250_I2C_Speed;

    /* Apply I2C configuration after enabling it */
    I2C_Init(MPU9250_I2C, &I2C_InitStructure);
    /* I2C Peripheral Enable */
    I2C_Cmd(MPU9250_I2C, ENABLE);
		
		MPU6050_I2C_Init();
/**************************************************************************************************
*											Timer
**************************************************************************************************/
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

		TIM_TimeBaseInitTypeDef timerInitStructure; 
		timerInitStructure.TIM_Prescaler = 36000;
		timerInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
		timerInitStructure.TIM_Period = 2-1;
		timerInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
		timerInitStructure.TIM_RepetitionCounter = 0;
		TIM_TimeBaseInit(TIM4, &timerInitStructure);
		TIM_Cmd(TIM4, ENABLE);
		TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);
		
		NVIC_InitTypeDef NVIC_InitStructure;
		NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );
		/*----- NVIC Timer interrupt -----*/
			NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
			NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
			NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
			NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
			NVIC_Init(&NVIC_InitStructure);
		
/**************************************************************************************************
*											Check_Connection
**************************************************************************************************/
	/*---- Reset MPU9250 ----*/
	MPU9250_Reset(0);
	MPU9250_Reset(1);
	
		U_Print_Char(USART1,"let's go\n");
			
		/*----- Check Connection of MPU9250 -----*/
		if (Check_Connection(WHO_AM_I_MPU9250, MPU9250_ADDRESS_DEFAULT, 0x73))
		{
			U_Print_Char(USART1, "Found MPU9250 - number 1 ");
			calibrateMPU9250(gyroBias, accelBias);
			Print_Bias();
			Initialize(0);
			//Write_Byte(INT_PIN_CFG, MPU9250_ADDRESS_DEFAULT, 0x22);
			//u8 *a = new u8[1];
			//Read_data_buffer(INT_PIN_CFG, a, MPU9250_ADDRESS_DEFAULT, 1);
			//U_Print(USART1, a[0]);
			U_Print_Char(USART1, "Initialized");
		}
		else
			U_Print_Char(USART1, "Check Connection MPU");
		
		AK8963_turn_on(0);
		/*----- Check Connection of AK8963 -----*/
		if (Check_Connection(WHO_AM_I_AK8963, (AK8963_ADDRESS_DEFAULT), 0x48))
		{
			U_Print_Char(USART1, "Found AK8963\n");
			Initialize_AK8963(magCalibration);
			U_Print_Char(USART1, "AK8963 Initialized...\n");
		}
		else
			U_Print_Char(USART1, "Check Connection AK\n");
		
		AK8963_turn_off(0);
		
		U_Print_Char(USART1,"let's go - 2\n");
			//MPU6050_I2C_Init();
		/*----- Check Connection of MPU9250 -----*/
		if (Check_Connection(WHO_AM_I_MPU9250, MPU9250_ADDRESS_DEFAULT_ADO_HIGH, 0x73))
		{
			U_Print_Char(USART1, "Found MPU9250 - number 2 ");
			Initialize(1);
			//Write_Byte(INT_PIN_CFG, MPU9250_ADDRESS_DEFAULT, 0x22);
			//u8 *a = new u8[1];
			//Read_data_buffer(INT_PIN_CFG, a, MPU9250_ADDRESS_DEFAULT, 1);
			//U_Print(USART1, a[0]);
			U_Print_Char(USART1, "Initialized");
		}
		else
			U_Print_Char(USART1, "Check Connection MPU");
		
		AK8963_turn_on(1);
		/*----- Check Connection of AK8963 -----*/
		if (Check_Connection(WHO_AM_I_AK8963, (AK8963_ADDRESS_DEFAULT), 0x48))
		{
			U_Print_Char(USART1, "Found AK8963\n");
			//Initialize_AK8963();
			U_Print_Char(USART1, "AK8963 Initialized...\n");
		}
		else
			U_Print_Char(USART1, "Check Connection AK\n");
		AK8963_turn_off(1);
		
		if (MPU6050_TestConnection())
			U_Print_Char(USART1, "Found MPU6050 \n");
		MPU6050_Initialize();
		U_Print_Char(USART1, "Initialized...\n");
/**************************************************************************************************
*											Variables Init
**************************************************************************************************/
	Accel fAcc[3];
	Gyro fGyro[3];
	Mag fMag[2];
	Angle angle[3];
	char flag = 0;			
	/********* Kalman Init *********/
		kalman filter_pitch;
		kalman filter_roll;
		kalman filter_yaw;	
				
		kalman filter_pitch1;
		kalman filter_roll1;
		kalman filter_yaw1;	
		
		kalman filter_pitch2;
		kalman filter_roll2;
		kalman filter_yaw2;
	
		time_pre = 0;
		time_now = 0;
		
		magbias[0] = +470.;  // User environmental x-axis correction in milliGauss, should be automatically calculated
    magbias[1] = +120.;  // User environmental x-axis correction in milliGauss
    magbias[2] = +125.;  // User environmental x-axis correction in milliGauss
/**************************************************************************************************
*											Function Init
**************************************************************************************************/	
	/*********** Kalman Filter Init ***********/
		kalman_init(&filter_pitch, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		kalman_init(&filter_roll, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		kalman_init(&filter_yaw, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		
		kalman_init(&filter_pitch1, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		kalman_init(&filter_roll1, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		kalman_init(&filter_yaw1, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		
		kalman_init(&filter_pitch2, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		kalman_init(&filter_roll2, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
		kalman_init(&filter_yaw2, R_matrix, Q_Gyro_matrix, Q_Accel_matrix);
	while (1)
	{
/**************************************************************************************************
*											Get Central
**************************************************************************************************/
		if (((angle[1].pitch *Rad2Dree) < 100) && ((angle[2].yaw *Rad2Dree) < 300))	flag ++;
/**************************************************************************************************
*											Main Processing
**************************************************************************************************/
		//Create memory
		
		//Get_Accel(RawAccel, 0);Get_Accel(RawAccel1, 1);
		//Get_Gyro(RawGyro, 0);Get_Gyro(RawGyro1, 1);
		//MPU6050_GetRawAccelGyro(AccelGyro);
		U_Print_Char(USART1, "ACCEL & GYRO\n");
		LowPass_Accel(fAcc);
		LowPass_Gyro(fGyro);
	
		U_Print_Char(USART1, "MAG\n");
		LowPass_Mag(fMag);
			
			
		float R = sqrt(float((fAcc[0].x * fAcc[0].x + fAcc[0].y * fAcc[0].y + fAcc[0].z * fAcc[0].z )));
		float R1 = sqrt(float((fAcc[1].x * fAcc[1].x + fAcc[1].y * fAcc[1].y + fAcc[1].z * fAcc[1].z )));
		float R2 = sqrt(float((fAcc[2].x * fAcc[2].x + fAcc[2].y * fAcc[2].y + fAcc[2].z * fAcc[2].z )));
		//U_Print_float(USART1, R);
		//U_Print_Char(USART1, "\n");
//		U_Print_float(USART1, acos(Mag[1]/Distance(Mag[0],Mag[1])));
//		U_Print_Char(USART1, "\n");
//		U_Print_float(USART1, Distance(Mag[0],Mag[1]));
//		U_Print_Char(USART1, "\n");
//		U_Print_float(USART1, Mag[1]/Distance(Mag[0],Mag[1]));
//		U_Print_Char(USART1, "\n");
		
//		for (char i = 0; i < 3; i++)
//		{
//			if (fAcc[i].x > 32768) 
//			{
//				fAcc[i].x -= 65536;
//				//reverse = -1;
//			}
//			if (fAcc[i].y > 32768) 
//			{
//				fAcc[i].y -= 65536;
//				//reverse = -1;
//			}
//			if (fAcc[i].z > 32768) 
//			{
//				fAcc[i].z -= 65536;
//				//reverse = -1;
//			}
//			if (fGyro[i].x > 32768) 
//			{
//				fGyro[i].x -= 65536;
//				//reverse = -1;
//			}
//			if (fGyro[i].y > 32768) 
//			{
//				fGyro[i].y -= 65536;
//				//reverse = -1;
//			}
//			if (fGyro[i].z > 32768) 
//			{
//				fGyro[i].z -= 65536;
//				//reverse = -1;
//			}
//		}
//		if (fMag[0].x > 32768)				fMag[1].x -= 98304;
//			
//		if (fMag[0].y > 32768)				fMag[1].y -= 98304;
//			
//		if (fMag[0].z > 32768)				fMag[1].z -= 98304;
//		
//		if (fMag[1].x > 32768)				fMag[1].x -= 98304;
//			
//		if (fMag[1].y > 32768)				fMag[1].y -= 98304;
//			
//		if (fMag[1].z > 32768)				fMag[1].z -= 98304;
			
