fxanhkhoa/stm32f103_i2c--multi-sensor-mpu9250/Main.cpp
		float heading = atan2(fMag[0].y, fMag[0].x);
		//float heading1 = atan2(fMag[1].z, fMag[1].y);
		float heading1 = atan2(fMag[1].y, fMag[1].x);
		heading += declinationAngle;
		heading1 += declinationAngle;
		if (heading < 0) heading += 2*PI;
		if (heading > 2*PI) heading -= 2*PI;
		if (heading1 < 0) heading1 += 2*PI;
		if (heading1 > 2*PI) heading1 -= 2*PI;
		//U_Print_float(USART1, heading * Rad2Dree);
		//U_Print_Char(USART1, "   ");
		//U_Print_float(USART1, heading1 * Rad2Dree);
		//U_Print_Char(USART1, "\n");
		
		
		/************************** Put in Kalman **************************/	
		//kalman_predict(&filter_pitch, RawGyro[0],  ( time_now - time_pre));
    //kalman_update(&filter_pitch, acos((RawAccel[0]/R)));
		kalman_predict(&filter_pitch, fGyro[0].x,  ( time_now - time_pre));
    kalman_update(&filter_pitch, (fAcc[0].x/R));
    kalman_predict(&filter_roll, fGyro[0].y,  (time_now - time_pre));
    kalman_update(&filter_roll, acos(fAcc[0].y/R));
		
		kalman_predict(&filter_pitch1, fGyro[1].x,  ( time_now - time_pre));
    kalman_update(&filter_pitch1, (fAcc[1].x/R));
    kalman_predict(&filter_roll1, fGyro[1].y,  (time_now - time_pre));
    kalman_update(&filter_roll1, acos(fAcc[1].y/R1));
		
		kalman_predict(&filter_pitch1, fGyro[2].x,  ( time_now - time_pre));
    kalman_update(&filter_pitch2, acos(fAcc[2].x/R2));
    kalman_predict(&filter_roll2, fGyro[2].y,  (time_now - time_pre));
    kalman_update(&filter_roll2, acos(fAcc[2].y/R2));
		
//		/************************** Put in Kalman **************************/	
//		kalman_predict(&filter_pitch, RawGyro[0],  ( time_now - time_pre));
//    kalman_update(&filter_pitch, float(atan(RawAccel[0] / sqrt(RawAccel[1]*RawAccel[1] + RawAccel[2]*RawAccel[2]))));
//    kalman_predict(&filter_roll, RawGyro[1],  (time_now - time_pre));
//    kalman_update(&filter_roll, float(atan2(RawAccel[1],RawAccel[2])));
		
		/************************** Get Pitch, Roll, Yaw ***********************/
		angle[0].pitch = kalman_get_angle(&filter_pitch);
		angle[0].roll = kalman_get_angle(&filter_roll);
		angle[1].pitch = kalman_get_angle(&filter_pitch1);
		angle[1].roll = kalman_get_angle(&filter_roll1);
		angle[2].pitch = kalman_get_angle(&filter_pitch2);
		angle[2].roll = kalman_get_angle(&filter_roll2);
		
		
		kalman_predict(&filter_yaw, fGyro[0].z,  (time_now - time_pre));
    kalman_update(&filter_yaw, heading);
		kalman_predict(&filter_yaw1, fGyro[1].z,  (time_now - time_pre));
    kalman_update(&filter_yaw1, heading1);
//		kalman_predict(&filter_yaw, (float)acos(fMag[0].y/Distance(fMag[0].x,fMag[0].y)),  (time_now - time_pre));
//    kalman_update(&filter_yaw, (float)acos(fMag[0].y/Distance(fMag[1].x,fMag[1].y)));
		time_pre = time_now; // get current time
		
		if (time_pre == 0xffffffffffffffff)
			time_pre = time_now = 0;
		
		angle[0].yaw = kalman_get_angle(&filter_yaw);
		angle[1].yaw = kalman_get_angle(&filter_yaw1);
		
		//if (flag == 1)
//		{
			U_Print_Char(USART1, "Pitch ");
			U_Print_float(USART1, angle[0].roll * Rad2Dree);// pitch mpu 1
			U_Print_Char(USART1, "  ");
			U_Print_float(USART1, angle[1].yaw * Rad2Dree);// yaw mpu 2
			U_Print_Char(USART1, "  ");
			U_Print_float(USART1, angle[2].pitch * Rad2Dree);// roll mpu 3
			U_Print_Char(USART1, " \n");
			U_Print_Char(USART1, "Roll ");
			U_Print_float(USART1, angle[0].pitch * Rad2Dree);
			U_Print_Char(USART1, "  ");
			U_Print_float(USART1, angle[1].pitch * Rad2Dree);//
			U_Print_Char(USART1, " \n");
			U_Print_Char(USART1, "Yaw ");
			U_Print_float(USART1, angle[0].yaw * Rad2Dree);// yaw mpu 1
			U_Print_Char(USART1, "  ");
			U_Print_float(USART1, angle[1].roll * Rad2Dree);// pitch mpu 2
			U_Print_Char(USART1, "  ");
			U_Print_float(USART1, angle[2].roll * Rad2Dree);// pitch mpu 3
			U_Print_Char(USART1, " \n");
//		}
		//else U_Print_Char(USART1, "not \n");
		timer = 0;
		while (timer < 150);
		led_toggle();
	}
}


//static void prvSetupHardware( void )
//{
//	/* Start with the clocks in their expected state. */
//	RCC_DeInit();

//	/* Enable HSE (high speed external clock). */
//	RCC_HSEConfig( RCC_HSE_ON );

//	/* Wait till HSE is ready. */
//	while( RCC_GetFlagStatus( RCC_FLAG_HSERDY ) == RESET )
//	{
//	}

//	/* 2 wait states required on the flash. */
//	*( ( unsigned long * ) 0x40022000 ) = 0x02;

//	/* HCLK = SYSCLK */
//	RCC_HCLKConfig( RCC_SYSCLK_Div1 );

//	/* PCLK2 = HCLK */
//	RCC_PCLK2Config( RCC_HCLK_Div1 );

//	/* PCLK1 = HCLK/2 */
//	RCC_PCLK1Config( RCC_HCLK_Div2 );

//	/* PLLCLK = 8MHz * 9 = 72 MHz. */
//	RCC_PLLConfig( RCC_PLLSource_HSE_Div1, RCC_PLLMul_9 );

//	/* Enable PLL. */
//	RCC_PLLCmd( ENABLE );

//	/* Wait till PLL is ready. */
//	while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
//	{
//	}

//	/* Select PLL as system clock source. */
//	RCC_SYSCLKConfig( RCC_SYSCLKSource_PLLCLK );

//	/* Wait till PLL is used as system clock source. */
//	while( RCC_GetSYSCLKSource() != 0x08 )
//	{
//	}

//	/* Enable GPIOA, GPIOB, GPIOC, GPIOD, GPIOE and AFIO clocks */
//	RCC_APB2PeriphClockCmd(	RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB |RCC_APB2Periph_GPIOC
//							| RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_AFIO, ENABLE );

//	/* SPI2 Periph clock enable */
//	RCC_APB1PeriphClockCmd( RCC_APB1Periph_SPI2, ENABLE );


//	/* Set the Vector Table base address at 0x08000000 */
//	NVIC_SetVectorTable( NVIC_VectTab_FLASH, 0x0 );

//	NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );

//	/* Configure HCLK clock as SysTick clock source. */
//	SysTick_CLKSourceConfig( SysTick_CLKSource_HCLK );

//	//vParTestInitialise();
//}

void sleep(long i)
{
	for (long k = 0 ; k < i; k++);
}

extern "C" void TIM4_IRQHandler()
{
    if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET)
    {
        TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
				timer ++;
				time_now++;
    }
}

void led_toggle(void)
		{
				/* Read LED output (GPIOA PIN8) status */
				uint8_t led_bit = GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_13);
			 
				/* If LED output set, clear it */
				if(led_bit == (uint8_t)Bit_SET)
				{
						GPIO_ResetBits(GPIOC, GPIO_Pin_13);
				}
				/* If LED output clear, set it */
				else
				{
						GPIO_SetBits(GPIOC, GPIO_Pin_13);
				}
		}
		
float Distance(float x, float y)
{
	return sqrt(x*x + y*y);
}

