fxanhkhoa/stm32f103_i2c--multi-sensor-mpu9250/Main.cpp
//int Get_Central(kalman p, kalman r, kalman y)
//{
//	float *RawAccel = new float[3],
//				*RawGyro = new float[3],
//				*Mag = new float[3],
//				angle[3];
//	Get_Accel(RawAccel,0);
//	Get_Gyro(RawGyro,0);
//	Get_Mag(Mag);
//	double R = sqrt(float((RawAccel[0] * RawAccel[0] + RawAccel[1] * RawAccel[1] + RawAccel[2] * RawAccel[2] )));
//	if ((Mag[0] > 32768) && ( Mag[1] < 32768))
//		{
//			Mag[0] -= 98304; // 65536 + 32768
//			U_Print_float(USART1, Mag[0]);
//			U_Print_Char(USART1, "\n");
//		}
//		if ((Mag[0] > 32768) && ( Mag[1] > 32768))
//		{
//			Mag[0] -= 98304; // 65536 + 32768
//			Mag[1] -= 98304;
//			U_Print_float(USART1, Mag[0]);
//			U_Print_Char(USART1, "\n");
//		}
//		float heading = atan2(Mag[1], Mag[0]);
//		heading += declinationAngle;
//		if (heading < 0) heading += 2*PI;
//		if (heading > 2*PI) heading -= 2*PI;
//		kalman_predict(&p, RawGyro[0],  ( time_now - time_pre));
//    kalman_update(&p, acos((RawAccel[1]/R)));
//    kalman_predict(&r, RawGyro[1],  (time_now - time_pre));
//    kalman_update(&r, acos(RawAccel[1]/R));
//		angle[0] = kalman_get_angle(&p);
//		angle[1] = kalman_get_angle(&r);
//		
//		
//		kalman_predict(&y, RawGyro[2],  (time_now - time_pre));
//    kalman_update(&y, heading);
//		time_pre = time_now; // get current time
//		
//		angle[2] = kalman_get_angle(&y);
//		
//		U_Print_Char(USART1, "Pitch ");
//		U_Print_float(USART1, angle[1] * Rad2Dree);
//		U_Print_Char(USART1, " \n");
//		U_Print_Char(USART1, "Roll ");
//		U_Print_float(USART1, angle[0] * Rad2Dree);
//		U_Print_Char(USART1, " \n");
//		U_Print_Char(USART1, "Yaw ");
//		U_Print_float(USART1, angle[2] * Rad2Dree);
//		U_Print_Char(USART1, " \n");
//		
//		
//		if (((angle[2] * Rad2Dree) < 300) && ((angle[1] *Rad2Dree) <= 90))
//			return 1;
//		else return 0;
//		delete RawAccel;
//		delete RawGyro;
//		delete Mag;
//}

void LowPass_Accel(Accel fAcc[])
{
	float RawAccel[6];
		Get_Accel(RawAccel, 0);
		fAcc[0].x = RawAccel[0] * alpha + (fAcc[0].x * (1.0 - alpha));
		fAcc[0].y = RawAccel[1] * alpha + (fAcc[0].y * (1.0 - alpha));
		fAcc[0].z = RawAccel[2] * alpha + (fAcc[0].z * (1.0 - alpha));
	
		fAcc[0].x = RawAccel[0] - accelBias[0];
		fAcc[0].y = RawAccel[1] - accelBias[1];
		fAcc[0].z = RawAccel[2] - accelBias[2];
		
		Get_Accel(RawAccel, 1);
		fAcc[1].x = RawAccel[0] * alpha + (fAcc[1].x * (1.0 - alpha));
		fAcc[1].y = RawAccel[1] * alpha + (fAcc[1].y * (1.0 - alpha));
		fAcc[1].z = RawAccel[2] * alpha + (fAcc[1].z * (1.0 - alpha));
		
		MPU6050_GetRawAccelGyro(RawAccel);
		fAcc[2].x = RawAccel[0] * alpha + (fAcc[2].x * (1.0 - alpha));
		fAcc[2].y = RawAccel[1] * alpha + (fAcc[2].y * (1.0 - alpha));
		fAcc[2].z = RawAccel[2] * alpha + (fAcc[2].z * (1.0 - alpha));
		
//		U_Print_Char(USART1, "Accel MPU 0: ");
//		U_Print_float(USART1, fAcc[0].x);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fAcc[0].y);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fAcc[0].z);
//		U_Print_Char(USART1, "\n");
//		
//		U_Print_Char(USART1, "Accel MPU 1: ");
//		U_Print_float(USART1, fAcc[1].x);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fAcc[1].y);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fAcc[1].z);
//		U_Print_Char(USART1, "\n");
//		
		U_Print_Char(USART1, "Accel MPU 2: ");
		U_Print_float(USART1, fAcc[2].x);
		U_Print_Char(USART1, "  ");
		U_Print_float(USART1, fAcc[2].y);
		U_Print_Char(USART1, "  ");
		U_Print_float(USART1, fAcc[2].z);
		U_Print_Char(USART1, "\n");
}

void LowPass_Gyro(Gyro fGyro[])
{
	float Raw[6];
		Get_Gyro(Raw, 0);
		fGyro[0].x = Raw[0] * alpha + (fGyro[0].x * (1.0 - alpha));
		fGyro[0].y = Raw[1] * alpha + (fGyro[0].y * (1.0 - alpha));
		fGyro[0].z = Raw[2] * alpha + (fGyro[0].z * (1.0 - alpha));
//		fGyro[0].x = Raw[0] - gyroBias[0];
//		fGyro[0].y = Raw[1] - gyroBias[1];
//		fGyro[0].z = Raw[2]	- gyroBias[2];
		
		Get_Gyro(Raw, 1);
		fGyro[1].x = Raw[0] * alpha + (fGyro[1].x * (1.0 - alpha));
		fGyro[1].y = Raw[1] * alpha + (fGyro[1].y * (1.0 - alpha));
		fGyro[1].z = Raw[2] * alpha + (fGyro[1].z * (1.0 - alpha));
		
		MPU6050_GetRawAccelGyro(Raw);
		fGyro[2].x = Raw[3] * alpha + (fGyro[2].x * (1.0 - alpha));
		fGyro[2].y = Raw[4] * alpha + (fGyro[2].y * (1.0 - alpha));
		fGyro[2].z = Raw[5] * alpha + (fGyro[2].z * (1.0 - alpha));
		
//		U_Print_Char(USART1, "Gyro MPU 0: ");
//		U_Print_float(USART1, fGyro[0].x);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fGyro[0].y);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fGyro[0].z);
//		U_Print_Char(USART1, "\n");
//		
//		U_Print_Char(USART1, "Gyro MPU 1: ");
//		U_Print_float(USART1, fGyro[1].x);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fGyro[1].y);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fGyro[1].z);
//		U_Print_Char(USART1, "\n");
//		
//		U_Print_Char(USART1, "Gyro MPU 2: ");
//		U_Print_float(USART1, fGyro[2].x);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fGyro[2].y);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fGyro[2].z);
//		U_Print_Char(USART1, "\n");
}

void LowPass_Mag(Mag fMag[])
{
		float Raw[3];
		AK8963_turn_on(0);
		Initialize_AK8963(Raw);
		Get_Mag(Raw);
		AK8963_turn_off(0);
	
		fMag[0].x = Raw[0] * alpha + (fMag[0].x * (1.0 - alpha));
		fMag[0].y = Raw[1] * alpha + (fMag[0].y * (1.0 - alpha));
		fMag[0].z = Raw[2] * alpha + (fMag[0].z * (1.0 - alpha));
	
//		fMag[0].x = Raw[0]*magCalibration[0] - magbias[0];
//		fMag[0].y = Raw[1]*magCalibration[1] - magbias[1];
//		fMag[0].z = Raw[2]*magCalibration[2] - magbias[2];
	
//		U_Print_Char(USART1, "Mag MPU 0: ");
//		U_Print_float(USART1, fMag[0].x);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fMag[0].y);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fMag[0].z);
//		U_Print_Char(USART1, "\n");
		
		AK8963_turn_on(1);
		Initialize_AK8963(Raw);
		Get_Mag(Raw);
		AK8963_turn_off(1);
		
		fMag[1].x = Raw[0] * alpha + (fMag[1].x * (1.0 - alpha));
		fMag[1].y = Raw[1] * alpha + (fMag[1].y * (1.0 - alpha));
		fMag[1].z = Raw[2] * alpha + (fMag[1].z * (1.0 - alpha));
	
//		U_Print_Char(USART1, "Mag MPU 1: ");
//		U_Print_float(USART1, fMag[1].x);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fMag[1].y);
//		U_Print_Char(USART1, "  ");
//		U_Print_float(USART1, fMag[1].z);
//		U_Print_Char(USART1, "\n");
}

void Print_Bias()
{
	U_Print_float(USART1, accelBias[0]);
	U_Print_Char(USART1,"   ");
	U_Print_float(USART1, accelBias[0]);
	U_Print_Char(USART1,"   ");
	U_Print_float(USART1, accelBias[0]);
	U_Print_Char(USART1,"\n");
			
	U_Print_float(USART1, gyroBias[0]);
	U_Print_Char(USART1,"   ");
	U_Print_float(USART1, gyroBias[0]);
	U_Print_Char(USART1,"   ");
	U_Print_float(USART1, gyroBias[0]);
	U_Print_Char(USART1,"   ");
}
